import styles from './Main.module.css';
import Product from '../product/Product';
import Productreview from '../productReview/Productreview';
import React from 'react';

const Main: React.FC = () => {
    const productItem = {
        img: 'https://static.yakaboo.ua/media/cloudflare/product/webp/600x840/i/m/img269_1_2.jpg',
        title: 'Майстер і Маргарита',
        autor: 'Михаил Булгаков',
        category: 'надприродне',
        numbOfPages: '416',
        description: 'Роман "Майстер і Маргарита" Михайло Булгаков почав писати 1928-го чи 1929 року. Серед дійових осіб у першій редакції не було ані Майстра, ані Марґарити. На початку 1930 року Булгаков свій незакінчений роман спалив. Восени 1932-го письменник повертається до роботи над головним твором свого життя. Правка роману триває з перервами до останніх днів автора. Роман став класикою світової літератури, витримав багатомільйонні тиражі у нас і за кордоном. Його перекладено багатьма мовами Європи, Америки, Азії, неодноразово інсценовано й екранізовано. За його сюжетом створені опери і балети. Тріумфальна хода безсмертної сатиричної фантасмагорії-феєрії з геніальною вставною новелою про Христа і Пілата продовжується!',
        review: [
            { reviewAutor: 'Марія', reviewDate: '22.06.2020', reviewText: 'Даний роман читала в школі, але в скороченому варіанті, однак нещодавно захотілось прочитати повну версію і, якщо чесно, то я залишилась розчарованою. Все ж школі "Майстер і Маргарита" мені більше сподобався. "Майстер і Маргарита" - фантастичний роман Михайла Булгакова, який, до речі, жодного разу не публікувався за життя автора, взагалі автора і до нині звинувачують у пропаганді сатанізму. Однак сьогодні за мотивами роману знято ряд фільмів та ставлять театральні вистави. Отож, сюжет. Він нудний, затягнений, багато зайвої інформації. Особисто мене дратувало те, що автор одну сюжетну лінію раптово обриває іншою. . Щодо героїв, то їхні образи вийшли такі собі, під час читання я не відчувала співпереживання за них. Крім того, любовна історія між Майстром і Маргаритою залишила мене байдужою. Напевне, даний роман більше сподобається поціновувачам класики. З плюсів книжки все ж варто виділити низку цитати. Хоча книжка мені не сподобався я раджу її прочитати, хоча б для того, щоб бути ознайомленим з таким відомим твором.' },
            { reviewAutor: 'Мірошниченко Тетяна', reviewDate: '20.07.2020', reviewText: 'Коли не знаєш що почитати, треба обирати класику. Адже з класичними літературними творами нудно не буває. От і я взялася перечитати головний роман Михайла Булгакова «Майстер і Маргарита», який читала останній раз ще навчаючись у школі. І майже через 15 років я зрозуміла і сприйняла цей текст зовсім по іншому. Тоді я його не зрозуміла. Зараз він мною сприймається інакше, більш глибше та зрозуміліше. Хоча такі твори можна читати декілька разів продовж життя і кожного разу сприймати по різному. Адже у романі так тісно переплітається містичне і реальне, біблійне і демонічне, що стає важко визначитися чи ти більше симпатизуєш стороні добра, чи може стороні зла. Твір, безперечно, геніальний. І він вартий того, щоб його прочитати хоча б один раз. Аналогічний роман важко знайти у всій світовій літературі. Є в ньому щось таке, що міцно притягує до себе читача. Я не могла начитатися. Не могла відірватися. І довго прокручувала сторінки роману у своїй голові. І я впевнена, що прочитаю його іще раз. І окрема подяка за чудовий український переклад.' }
        ]
    }

    return (
        <>
            <div className={`container ${styles.mainwrap}`}>
                <div className={`container ${styles.sectionwrap}`} >
                    <section ><div className={styles.productImg}><img src={productItem.img} alt="" /></div></section>
                    <section><Product productItem={productItem} /></section>
                </div>
                <section><Productreview productReview={productItem.review} /></section>
            </div>
        </>
    )
}
export default Main;