<div class="main">
  <section>
    <div class="container">
      <div class="about-header">
        <a href="/">Головна</a>
        <div class="green-dot"></div>
        <span>Політика конфіденційності</span>
      </div>
      <div class="about-title">
        <img src="images/banner-title.svg" alt="Аграрний інтернет-магазин" />
        <h2>Політика конфіденційності</h2>
        <img src="images/banner-title.svg" alt="Аграрний інтернет-магазин" />
      </div>
      <div class="about-text dark-text">
        <p>DAT дотримується принципів конфіденційності й недоторканості інформації, отриманої від клієнтів DAT в рамках надання послуг поштового зв’язку.
          <br><br>DAT гарантує збереження інформації з обмеженим доступом та захист персональних даних користувачів послуг поштового зв’язку (далі – Користувачі), у т.ч. при використанні офіційного сайту Укрпошти, мобільних застосунків, прикладних програмних інтерфейсів та застосувань, платежів та переказів за платіжними системами тощо (далі – Послуги).
          <br><br>Політика конфіденційності (далі – Політика) націлена на публічне інформування Користувачів про порядок збору (обробки), зберігання, передачі персональних даних та інформації, що надається в рамках надання Послуг Укрпошти.

          <br><br>Використовуючи Послуги DAT, Користувач погоджується з усіма правилами та умовами Політики.

          <br><br>Перед початком використання Послуг просимо ознайомитися з Політикою.
        </p><br>
        <p><span>МЕТА ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ</span></p>
        <p>
          Метою обробки персональних даних є надання Послуг. </p>
        <br>
        <p><span>ЗБІР ПЕРСОНАЛЬНИХ ДАНИХ</span></p>
        <p>
          Персональні дані – відомості чи сукупність відомостей про Користувача, який ідентифікований або може бути конкретно ідентифікований.

          <br><br>Неперсоніфікована інформація — інформація, яка не прив’язана до конкретного Користувача Послуг.

          <br><br>Персональні дані, які обробляє ..., охоплюють контактні дані, які надаються Користувачами при використанні Послуг (прізвище, ім’я, по батькові, номер телефону, адреса електронної пошти тощо); яка використовується для оплати товарів та Послуг Укрпошти; номери та історію поштових відправлень тощо. Інформація отримується при використанні Користувачем Послуг, у т.ч. за допомогою сайту Укрпошти, мобільних застосунків тощо. Дані передаються Користувачами добровільно з метою забезпечення можливості виконання Укрпоштою зобов’язань за Послугами.

          <br><br>Неперсоніфікована інформація використовується виключно для формування статистичних даних та з метою покращення Послуг, у т.ч. інформування Користувача про нові Послуги. Зокрема у разі використання мобільного застосунку, - версія операційної системи, приблизне місцезнаходження мобільного пристрою у разі самостійного надання згоди Користувачем на використання гео-локації, IP-адреса пристрою, дата та час авторизації у мобільному застосунку.
        </p>
        <br>
        <p><span>ВИКОРИСТАННЯ ІНФОРМАЦІЇ</span></p>
        <p>
          Інформація, яку отримує Укрпошта, використовується для:
          <br><br> - створення облікового запису Користувача;
          <br><br> - надання Послуги або функції, яку замовив Користувач;
          <br><br> - зв’язку з Користувачами з метою інформування про персоналізовані унікальні пропозиції та акції Укрпошти;
          <br><br> - оцінки та аналізу ринку, клієнтів, продуктів та сервісів, які надаються Укрпоштою;
          <br><br> - ефективного клієнтського обслуговування;
          <br><br> - забезпечення оновлення і технічної підтримки Послуг, у т.ч. мобільного застосунку на пристрої Користувача;
          <br><br> - будь-яких інших цілей в обсязі, достатньому для якісного надання Послуг.
        </p>
        <br>
        <p><span>ПЕРЕДАЧА ІНФОРМАЦІЇ ТРЕТІМ ОСОБАМ</span></p>
        <p>
          Укрпошта може передавати інформацію отриману від Користувачів в рамках надання Послуг третім особам з метою належного виконання своїх обов’язків за цими Послугами.

          <br><br>Поширення Укрпоштою персональних даних без згоди Користувача або уповноваженої ним особи дозволяється у випадках, визначених законом, і лише (якщо це необхідно) в інтересах національної безпеки, економічного добробуту та прав людини.
        </p>
        <br>
        <p><span>ЗАХИСТ КОНФЕДЕНЦІЙНОЇ ІНФОРМАЦІЇ ТА ІНФОРМАЦІЇ ПРО КОРИСТУВАЧА</span></p>
        <p>
          Конфіденційна інформація, персональні дані та неперсоніфікована інформація зберігаються на внутрішніх ресурсах Укрпошти, доступ до яких обмежується згідно з вимогами положень Політики інформаційної безпеки Укрпошти.</p>
        <br>
        <p><span>БЕЗПЕКА</span></p>
        <p>
          На веб-ресурсах Укрпошти вжиті достатні заходи для захисту інформації, проте просимо прийняти до уваги, що абсолютно безпечного та безпомилкового шляху передачі даних мережею Інтернет не існує.

          Укрпошта не несе відповідальності за функціонування серверів, постачальників послуги доступу до мережі Інтернет, роботу третіх осіб, з вини яких може бути неможливий чи обмежений доступ до сайту, можливий витік інформації з вини третіх осіб, а також за розголошення Користувачем своїх персональних даних, у т.ч. даних авторизації на сайті Укрпошти, у мобільних застосунках, прикладних програмних інтерфейсах та застосуваннях.

          <br><br>Інформація, що розміщена на веб-ресурсах Укрпошти, охороняється діючим законодавством, яке регулює право інтелектуальної власності. Тиражування, переклад, запис в архіві, копіювання на інші електронні носії інформації, яка розміщена, заборонена.</p>
        <br>
        <p><span>ФАЙЛИ COKIE</span></p>
        <p>
          Cookie — це невеликі текстові файли, які зберігаються на пристроях Користувача під час відвідування сайту Укрпошти. На сайті Укрпошти можуть бути використані файли cookie, щоб зрозуміти, який вміст вас цікавить, і запам’ятати вас, якщо ви знову завітаєте на сайт. Укрпошта зберігає файли cookie, щоб забезпечити технічно бездоганне і оптимізоване надання Послуг.

          <br><br> Файли cookie, які можуть бути використані Укрпоштою, не можуть завдати шкоди пристроям Користувача. Більшість файлів cookie, які можуть бути використані Укрпоштою, є так званими сеансовими файлами cookie, які автоматично видаляються в кінці відвідування Користувачем веб-сайту Укрпошти. Інші файли cookie залишаються на пристроях Користувача до тих пір, поки він їх не видалить. Ці файли cookie дозволяють розпізнавати браузер Користувача при наступному відвідуванні.</p>
      </div>
    </div>
  </section>
</div>