<div class="main">
  <section>
    <div class="container">
      <div class="about-header">
        <a href="/">Головна</a>
        <div class="green-dot"></div>
        <span>Про нас</span>
      </div>
      <div class="about-title">
        <img src="images/banner-title.svg" alt="Аграрний інтернет-магазин" />
        <h2>Про нас</h2>
        <img src="images/banner-title.svg" alt="Аграрний інтернет-магазин" />
      </div>
      <div class="about-text">
        <p>
          <span>«Компанія ТОВ “ДАМАР АГРОТРЕЙД”</span> — молода команда, яка з’явилась
          на аграрному ринку у 2020 році. Ми не боїмось труднощів і
          викликів. Тому навіть складний ковідний період, світова пандемія
          не стали на заваді успішному старту.
        </p>
        <p>
          Отже, <span>ми — сміливі, ми — драйвові</span>, ми — ті, що розвивають
          рослинництво та допомагають ставати успішними тисячам
          вітчизняних аграріїв.
        </p>
        <p>
          <span>Бачення:</span> компанія ТОВ “ДАМАР АГРОТРЕЙД” тримає курс на
          підвищення престижності, довіри до засобів захисту рослин made
          in UA. Прагнемо, аби в кожному регіоні України наш споживач мав
          доступ до якісної продукції та консалтингу від фахівців команди.
        </p>
        <p>
          <span>Місія:</span> усе продуктове портфоліо, консультативні послуги ТОВ
          “ДАМАР АГРОТРЕЙД” направлені на підвищення рентабельності
          рослинництва в мінливих кліматичних умовах України. Також
          ставимо собі завдання підвищувати обізнаність клієнтів щодо
          сучасних методів ведення рослинництва...
        </p>
        <p>
          <span>Цінності:</span> <br>
        <ul>
          <li>прозорість ділових стосунків з колегами, контрагентами, клієнтами;</li>
          <li>однаково висококласний сервіс для невеликого фермера та потужного холдингу;</li>
          <li>покращення якості товарів та послуг;</li>
          <li>постійна підтримка партнера на усіх етапах виробництва продукції рослинництва;</li>
          <li>екологічність у роботі, думках та цілях;</li>
          <li>підтримка вітчизняного продукту та вітчизняного виробника;</li>
          <li>постійний саморозвиток.…»</li>
        </ul>
        </p>
      </div>
    </div>
  </section>
</div>