<div class="main">
  <section>
    <div class="container">
      <div class="about-header">
        <a href="/">Головна</a>
        <div class="green-dot"></div>
        <span>Корпоративний кодекс</span>
      </div>
      <div class="about-title">
        <img src="images/banner-title.svg" alt="Аграрний інтернет-магазин" />
        <h2>Корпоративний кодекс</h2>
        <img src="images/banner-title.svg" alt="Аграрний інтернет-магазин" />
      </div>
      <div class="about-text dark-text">
        <p><span>1. ВСТУП</span></p>
        <p>
          1.1 Кодекс корпоративної етики співробітника АТ «ЗФЗ (далі – Кодекс) є зводом етичних і моральних норм, правил поведінки, що приймаються і поділяються кожним працівником підприємства, незалежно від рівня займаної ним посади. Кожен співробітник АТ «ЗФЗ» приймає на себе обов’язок в ході своєї діяльності керуватися положеннями даного Кодексу.
          <br><br>1.2 Основна мета Кодексу – визначення і закріплення стандартів діяльності і поведінки працівників, спрямованих на підвищення прибутковості, успішності та ефективності підприємства, а також на підвищення рівня внутрішньокорпоративного життя наших співробітників.

          <br><br>1.3 Персонал і керівники всіх ланок не мають права приймати рішення або здійснювати будь-які дії, що йдуть всупереч з корпоративними цінностями і можуть завдати шкоди діловій репутації та інтересам АТ «ЗФЗ».

          <br><br>1.4 Вступаючи на роботу, кожен співробітник знайомиться з текстом цього Кодексу, приймає і поділяє його принципи, усвідомлює їх обов'язковий характер в рамках своєї професійної діяльності.

          <br><br>1.5 Право на внесення пропозицій про зміни, уточнення або розширення норм Кодексу має кожен працівник підприємства.
        </p>
        <br>
        <p><span>2. ЦІННОСТІ DAT</span></p>
        <p>
          2.1 Потенціал співробітників.

          <br><br>Співробітники – наша основна цінність. Ми маємо намір створювати всі умови для дотримання інтересів наших співробітників, тому для ЗФЗ є важливими:

          <br><br> - професійний та особистий розвиток працівників;

          <br><br> - справедлива оцінка внеску кожного працівника;

          <br><br>- ініціативність працівників;

          <br><br>- створення сприятливого морально-психологічного клімату і нормальних умов праці на робочих місцях;

          <br><br>- турбота про здоров'я і добробут працівників і членів їх сімей.

          <br><br> 2.2 Лідерство

          <br><br>Ми прагнемо бути лідерами. Ми впевнені, що безвихідних ситуацій не буває. Знайти шляхи їх вирішення – наше основне завдання.

          <br><br>Нам притаманний «бійцівський дух»: ми впевнені в своїх силах і зможемо вирішити будь-яке завдання швидше, краще за наших конкурентів; ми не зупиняємося на півшляху, посилаючись на труднощі, ми досягаємо поставленої мети.
          <br><br> 2.3 Результативність

          <br><br>Ми прагнемо до оптимального використання всіх ресурсів, грамотного управління, оперативності та точності виконання поставлених задач, високої продуктивності праці в усіх сферах діяльності, до досягнення максимально можливих результатів за умови оптимального використання людських, природних і фінансових ресурсів. Ми вміємо мобілізуватися і виконати завдання в найкоротші терміни. Ми прагнемо спілкуватися один з одним без зайвих бюрократичних процедур узгодження, візування документів.

          <br><br>2.4 Професіоналізм
          <br><br>Професіоналізм – це глибоке знання своєї спеціальності, відповідальне і сумлінне ставлення до обов'язків, якісне і своєчасне виконання поставлених завдань, вдосконалення професійного рівня. Відносини всередині підприємства будуються на основі прямої зацікавленості співробітників в результаті роботи, що дозволяє їм стати професіоналами в різних галузях. Прийняти оптимальне рішення, дати грамотну консультацію в межах своєї компетенції – справа честі кожного працівника. Всі рішення приймаються з точки зору компетентності і доцільності.

          <br><br> 2.5 Новаторство / іноваційність

          <br><br> Інноваційність стосується будь-якого аспекту діяльності підприємства: маркетингу, логістики, фінансової діяльності, кадрової політики, IT-технологій і т.д. Ми особливо цінуємо працівників, зараховуючи їх до Кадрового резерву. Наші працівники націлені на подальший розвиток своїх навичок і компетенцій, їх застосування на практиці. На АТ «ЗФЗ» створена система безперервного навчання, збереження і передачі накопиченого досвіду.
        </p>
        <br>
        <p><span>3. ПРИНЦИПИ ДІЯЛЬНОСТІ АТ "ЗФЗ"</span></p>
        <p>
          3.1. АТ «ЗФЗ» відкрите перед суспільством;

          <br><br>3.2. АТ «ЗФЗ» цінує і поважає своїх співробітників.
          <br><br> На підприємстві поважають людську гідність і права людини. Ми з повагою ставимося до співрозмовника і його думки. У відносинах між працівниками неприпустима агресія і грубість. Прийняття рішень стосовно працівників має грунтуватися на об'єктивний даних і фактах.

          <br><br>3.3. АТ «ЗФЗ» визнає лише чесний спосіб ведення ринкової конкуренції;

          <br><br>3.4. АТ «ЗФЗ» дорожить діловою репутацією і високою довірою з боку партнерів;
        </p>
        <br>
        <p><span>4. ВІДПОВІДАЛЬНІСТЬ ПІДПРИЄМСТВА</span></p>
        <p>
          4.1 Перед акціонерами:
          <br>- за динамічне зростання і розвиток підприємства;

          <br><br>- за ефективність діяльності;

          <br><br>- за підтримку високої репутації.

          <br><br>4.2 Перед клієнтами:

          <br><br>- за постійне підвищення якості готової продукції;

          <br><br>- за надання достовірної і своєчасної інформації про продукцію підприємства.

          <br><br>4.3 Перед діловими партнерами:

          <br><br>- за дотримання принципів ділової етики, прийнятих на підприємстві;

          <br><br>- за своєчасне і точне виконання умов всіх укладених договорів;

          <br><br> - за свої слова і вчинки;

          <br><br>- за дотримання принципу чесної конкуренції.

          <br><br>4.4 Перед колективом АТ «ЗФЗ»:

          <br><br> - за своєчасну виплату заробітної плати;

          <br><br>- за надання можливостей особистого та професійного зростання, кар'єрного просування, відповідно до знань співробітників, їх здібностей і прикладених до роботи зусиль;

          <br><br> - за надання соціальних гарантій, визначених у внутрішніх нормативних документах кількості пільг і компенсацій;

          <br><br>- за надання працівникам нормальних умов праці;

          <br><br>- за своєчасне надання працівникам достовірної інформації про досягнення і зміни, що відбуваються на підприємстві;

          <br><br>- за етичне і шанобливе ставлення до працівників підприємства.
        </p>
        <br>
        <p><span>5. НОРМИ І ПРАВИЛА КОРПОРАТИВНОЇ ЕТИКИ</span></p>
        <p>
          5.1 Ставлення до сфери зв'язків з громадськістю та ЗМІ

          <br><br> АТ «ЗФЗ» стежить за дотриманням високих етичних стандартів у відносинах із засобами масової інформації, не допускає поширення недостовірної інформації, приховування та / або спотворення фактів у своїй публічній діяльності або інших заходах по зв'язкам з громадськістю.

          <br><br>Всі контакти зі ЗМІ здійснюються співробітниками в рамках своєї компетенції та за узгодженням як з безпосереднім керівником, так і з Головою Правління.

          <br><br>Самостійно взаємодіяти зі ЗМІ з робочих питань співробітникам підприємства заборонено.

          <br><br> 5.2 Внутрішній контроль

          <br><br> В основі діяльності АТ «ЗФЗ» – чесність, інформаційна прозорість і відкритість при веденні бухгалтерського обліку, розробці бюджетів і оцінці ефективності проектів. Вся наша діяльність здійснюється в суворій відповідності до законодавчих актів і внутрішньої нормативної документації.

          <br><br>Ефективна система внутрішнього контролю є важливим компонентом управління і дозволяє уникнути ризиків, пов'язаних з відхиленням від регламентуючих актів у функціональній діяльності підрозділів.

          <br><br> 5.3 Конфіденційна інформація

          <br><br>Будь-яка інформація, окрім загальнодоступної, яка відома працівникові за фахом роботи, є конфіденційною і не підлягає розголошенню, в тому числі й іншим співробітникам, яким вона не потрібна для виконання ними своїх службових обов'язків.
          <br><br> При вступі на роботу, співробітник приймає на себе правові та етичні зобов'язання не розголошувати конфіденційну та ту, що являє комерційну таємницю, інформацію в період роботи на підприємстві і після звільнення з нього.

          <br><br>5.4 Політична та громадська діяльність
          <br><br> АТ «ЗФЗ» не підтримує будь-які політичні партії і рухи. Наші працівники, які беруть участь в діяльності політичних партій, можуть діяти виключно у вільний час і тільки як приватні особи, а не як представники «ЗФЗ».
        </p>
        <br>
      </div>
    </div>
  </section>
</div>